&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Основание.Пустая() Тогда
		Отказ = Истина;
		Сообщить("Документ можно создать только на основании ""Списание вещевого имущества"".");
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеСоСклада.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписаниеСоСклада КАК СписаниеСоСклада
		|ГДЕ
		|	СписаниеСоСклада.Основание = &Основание";
		
		Запрос.УстановитьПараметр("Основание", Объект.Основание);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Отказ = Истина;
			Сообщить("""Списание со склада"" уже было оформлено на основании выбранного документа: " + ВыборкаДетальныеЗаписи.Ссылка);
			
		КонецЦикла;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ОбъектДок = РеквизитФормыВЗначение("Объект");
		
		ОбъектДок.Дата = ТекущаяДата();
		
		ОбъектДок.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗначениеВРеквизитФормы(ОбъектДок, "Объект");
		
		ЭтаФорма.Прочитать();
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
