
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.СписаниеВещевогоИмущества.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеВещевогоИмущества.Дата,
	|	СписаниеВещевогоИмущества.Комментарий,
	|	СписаниеВещевогоИмущества.Номер,
	|	СписаниеВещевогоИмущества.Организация,
	|	СписаниеВещевогоИмущества.Ответственный,
	|	СписаниеВещевогоИмущества.Склад,
	|	СписаниеВещевогоИмущества.ФизическоеЛицо,
	|	СписаниеВещевогоИмущества.ВещевоеИмущество.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Размер,
	|		Количество,
	|		Причина
	|	)
	|ИЗ
	|	Документ.СписаниеВещевогоИмущества КАК СписаниеВещевогоИмущества
	|ГДЕ
	|	СписаниеВещевогоИмущества.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВещевоеИмуществоШапка = Макет.ПолучитьОбласть("ВещевоеИмуществоШапка");
	ОбластьВещевоеИмущество = Макет.ПолучитьОбласть("ВещевоеИмущество");
	Подвал = Макет.ПолучитьОбласть("Подвал");
    Подпись = Макет.ПолучитьОбласть("Подпись");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВещевоеИмуществоШапка);
		ВыборкаВещевоеИмущество = Выборка.ВещевоеИмущество.Выбрать();
		Пока ВыборкаВещевоеИмущество.Следующий() Цикл
			ОбластьВещевоеИмущество.Параметры.Заполнить(ВыборкаВещевоеИмущество);
			ТабДок.Вывести(ОбластьВещевоеИмущество, ВыборкаВещевоеИмущество.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
        ТабДок.Вывести(Подпись);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
