
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НовыйДокумент = Документы.СписаниеСоСклада.СоздатьДокумент();
	
	
	НовыйДокумент.Дата = Дата;  
	НовыйДокумент.Организация = Организация;
	НовыйДокумент.Склад = Склад;
	НовыйДокумент.ФизическоеЛицо = ФизическоеЛицо;
	НовыйДокумент.Комментарий = Комментарий;
	НовыйДокумент.Ответственный = Ответственный;
	НовыйДокумент.Основание = Ссылка;
	
	Для Каждого СтрокаИсходник Из ВещевоеИмущество Цикл
		НоваяСтрока = НовыйДокумент.ВещевоеИмущество.Добавить(); 
		НоваяСтрока.Номенклатура = СтрокаИсходник.Номенклатура;
		НоваяСтрока.Размер = СтрокаИсходник.Размер;
		НоваяСтрока.Количество = СтрокаИсходник.Количество;
		НоваяСтрока.Причина = СтрокаИсходник.Причина;
	КонецЦикла;
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	
	
	Движения.НоменклатураСотрудников.Записывать = Истина;
	Движения.НоменклатураСотрудников.Записать();
	Движения.НоменклатураСотрудников.Записывать = Истина;
	Движения.НоменклатураНаСкладах.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратВещевогоИмуществаВещевоеИмущество.Номенклатура КАК Номенклатура,
	|	ВозвратВещевогоИмуществаВещевоеИмущество.Размер КАК Размер,
	|	СУММА(ВозвратВещевогоИмуществаВещевоеИмущество.Количество) КАК Количество,
	|	ВозвратВещевогоИмуществаВещевоеИмущество.Ссылка.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВещевоеИмущество
	|ИЗ
	|	Документ.СписаниеВещевогоИмущества.ВещевоеИмущество КАК ВозвратВещевогоИмуществаВещевоеИмущество
	|ГДЕ
	|	ВозвратВещевогоИмуществаВещевоеИмущество.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратВещевогоИмуществаВещевоеИмущество.Ссылка.ФизическоеЛицо,
	|	ВозвратВещевогоИмуществаВещевоеИмущество.Номенклатура,
	|	ВозвратВещевогоИмуществаВещевоеИмущество.Размер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВещевоеИмущество.Номенклатура КАК Номенклатура,
	|	ВТ_ВещевоеИмущество.Размер КАК Размер,
	|	ВТ_ВещевоеИмущество.Количество КАК Количество,
	|	ЕСТЬNULL(НоменклатураСотрудниковОстатки.КоличествоОстаток, 0) КАК КоличествоСотрудника,
	|	НоменклатураСотрудниковОстатки.ПлановаяДатаСписания КАК ПлановаяДатаСписания
	|ИЗ
	|	ВТ_ВещевоеИмущество КАК ВТ_ВещевоеИмущество
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НоменклатураСотрудников.Остатки(
	|				&Дата,
	|				(Номенклатура, Размер, ФизическоеЛицо) В
	|						(ВЫБРАТЬ
	|							ВТ_ВещевоеИмущество.Номенклатура КАК Номенклатура,
	|							ВТ_ВещевоеИмущество.Размер КАК Размер,
	|							ВТ_ВещевоеИмущество.ФизическоеЛицо КАК ФизическоеЛицо
	|						ИЗ
	|							ВТ_ВещевоеИмущество КАК ВТ_ВещевоеИмущество)
	|					И Склад = &Склад
	|					И Организация = &Организация) КАК НоменклатураСотрудниковОстатки
	|		ПО ВТ_ВещевоеИмущество.Номенклатура = НоменклатураСотрудниковОстатки.Номенклатура
	|			И ВТ_ВещевоеИмущество.Размер = НоменклатураСотрудниковОстатки.Размер
	|			И ВТ_ВещевоеИмущество.ФизическоеЛицо = НоменклатураСотрудниковОстатки.ФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПлановаяДатаСписания
	|ИТОГИ
	|	СРЕДНЕЕ(Количество),
	|	СУММА(КоличествоСотрудника)
	|ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоСотрудника Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Превышение по возврату номенклатуры ""%1"" в количестве %2 шт.", ВыборкаНоменклатура.Номенклатура, 
			ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоСотрудника);
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоКСписанию = ВыборкаНоменклатура.Количество;
		
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СписатьПоСроку = Мин(КоличествоКСписанию, ВыборкаДетальныеЗаписи.КоличествоСотрудника);
			
			Движение = Движения.НоменклатураСотрудников.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Склад = Склад;
			Движение.ФизическоеЛицо = ФизическоеЛицо;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Размер = ВыборкаДетальныеЗаписи.Размер;
			Движение.ПлановаяДатаСписания = ВыборкаДетальныеЗаписи.ПлановаяДатаСписания;
			Движение.Количество = СписатьПоСроку;
			Движение.ОстатокСрока = (ВыборкаДетальныеЗаписи.ПлановаяДатаСписания - (КонецДня(ТекущаяДата()) + 1)) / 86400;
			
			Движение = Движения.НоменклатураНаСкладах.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Организация = Организация;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Размер = ВыборкаДетальныеЗаписи.Размер;
			Движение.Количество = СписатьПоСроку;
			
			КоличествоКСписанию = КоличествоКСписанию - СписатьПоСроку;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
