Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ВещевоеИмуществоСотрудников
	Движения.ВещевоеИмуществоСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущетво из ВещевоеИмущество Цикл
		Движение = Движения.ВещевоеИмуществоСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.Номенклатура = ТекСтрокаВещевоеИмущетво.Номенклатура;
		Движение.Размер = ТекСтрокаВещевоеИмущетво.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущетво.Количество;
	КонецЦикла;

	// регистр ТоварыНаСкладах
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущетво из ВещевоеИмущество Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаВещевоеИмущетво.Номенклатура;
		Движение.Размер = ТекСтрокаВещевоеИмущетво.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущетво.Количество;
	КонецЦикла;
КонецПроцедуры

Процедура ПриПроведении(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    СписаниеСоСклада.Ссылка
	|ИЗ
	|    Документ.СписаниеСоСклада КАК СписаниеСоСклада
	|ГДЕ
	|    СписаниеСоСклада.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ДокСписаниеСоСклада = Документы.СписаниеСоСклада.СоздатьДокумент();
	
	ДокСписаниеСоСклада.Дата = Дата;
	ДокСписаниеСоСклада.Организация = Организация;
	ДокСписаниеСоСклада.Склад = Склад;
	ДокСписаниеСоСклада.ДокументОснование = Ссылка;
	ДокСписаниеСоСклада.Комментарий = "Списание по документу " + Номер + " от " + Формат(Дата, "ДЛФ=Д");
	
	ДокСписаниеСоСклада.ВещевоеИмущество.Очистить();
	
	Для Каждого СтрокаТЧ Из ВещевоеИмущество Цикл
		НоваяСтрока = ДокСписаниеСоСклада.ВещевоеИмущество.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
		НоваяСтрока.Количество = СтрокаТЧ.Количество;
		НоваяСтрока.Размер = СтрокаТЧ.Размер;
	КонецЦикла;
	
	ДокСписаниеСоСклада.Записать(РежимЗаписиДокумента.Проведение);	
КонецПроцедуры