
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.СдачаНормативов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СдачаНормативов.Дата,
	|	СдачаНормативов.Инструктор,
	|	СдачаНормативов.Караул,
	|	СдачаНормативов.МестоПроведения,
	|	СдачаНормативов.НачальникКараула,
	|	СдачаНормативов.Номер,
	|	СдачаНормативов.Организация,
	|	СдачаНормативов.ТипТренировки,
	|	СдачаНормативов.Нормативы.(
	|		НомерСтроки,
	|		Сотрудник,
	|		Норматив,
	|		Результат,
	|		Оценка
	|	)
	|ИЗ
	|	Документ.СдачаНормативов КАК СдачаНормативов
	|ГДЕ
	|	СдачаНормативов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНормативыШапка = Макет.ПолучитьОбласть("НормативыШапка");
	ОбластьНормативы = Макет.ПолучитьОбласть("Нормативы");
	Подвал = Макет.ПолучитьОбласть("Подвал");
    Подпись = Макет.ПолучитьОбласть("Подпись");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНормативыШапка);
		ВыборкаНормативы = Выборка.Нормативы.Выбрать();
		Пока ВыборкаНормативы.Следующий() Цикл
			ОбластьНормативы.Параметры.Заполнить(ВыборкаНормативы);
			ТабДок.Вывести(ОбластьНормативы, ВыборкаНормативы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
        ТабДок.Вывести(Подпись);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
