Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланСдачиНормативов") Тогда
		План = ДанныеЗаполнения.ПолучитьОбъект();
		
		ЭтотОбъект.Нормативы.Очистить();

		// Заполнение шапки
		Инструктор = ДанныеЗаполнения.Инструктор;
		Караул = ДанныеЗаполнения.Караул;
		МестоПроведения = ДанныеЗаполнения.МестоПроведения;
		НачальникКараула = ДанныеЗаполнения.НачальникКараула;
		Организация = ДанныеЗаполнения.Организация;
		ТипТренировки = ДанныеЗаполнения.ТипТренировки;
		// Для КАЖДОГО сотрудника из плана
		Для Каждого СтрокаСотрудник Из План.Сотрудники Цикл
			
			// Для КАЖДОГО упражнения из плана
			Для Каждого СтрокаУпражнение Из План.Упражнения Цикл
				
				НоваяСтрока = ЭтотОбъект.Нормативы.Добавить();
				НоваяСтрока.Сотрудник = СтрокаСотрудник.Сотрудник;
				НоваяСтрока.Норматив = СтрокаУпражнение.Норматив;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
