&НаКлиенте
Процедура НормативыРезультатПриИзменении(Элемент)
	 ТекущаяСтрока = Элементы.Нормативы.ТекущиеДанные;
	 
	Если ТекущаяСтрока.Сотрудник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.Норматив = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Результат) Тогда
		ТекущаяСтрока.Оценка = "Не выполнил";
		Элементы.Нормативы.Обновить();
		Возврат;
	КонецЕсли;
	
	Попытка
		Оценка = РассчитатьОценкуНаСервере
		(ТекущаяСтрока.Сотрудник,
		ТекущаяСтрока.Норматив, 
		ТекущаяСтрока.Результат);
		ТекущаяСтрока.Оценка = Оценка;
		
	Исключение
		ТекущаяСтрока.Оценка = "Ошибка";
	КонецПопытки;
	
	Элементы.Нормативы.Обновить();
КонецПроцедуры
&НаСервере
Функция РассчитатьОценкуНаСервере(Сотрудник, Норматив, Результат)
	
	Попытка
		Возврат УправлениеНормативами.РассчитатьОценкуПоСотруднику
			(Сотрудник,
			Норматив,
			Результат,
			Объект.Дата);
	Исключение
		Возврат "Ошибка";
	КонецПопытки;
	
КонецФункции
