
&НаКлиенте
Процедура ТипТренировкиПриИзменении(Элемент)
    
    Объект.Упражнения.Очистить();
    Элементы.Упражнения.Обновить();
    
    Если Объект.ТипТренировки.Пустая() Тогда
        Возврат;
    КонецЕсли;
    
    НормативыТипаТренировки = ПолучитьНормативыТипаТренировкиНаСервере(Объект.ТипТренировки);
    
    Для Каждого НормативСсылка Из НормативыТипаТренировки Цикл
        НоваяСтрока = Объект.Упражнения.Добавить();
        НоваяСтрока.Норматив = НормативСсылка; 
    КонецЦикла;
    
КонецПроцедуры
&НаСервере
Функция ПолучитьНормативыТипаТренировкиНаСервере(ТипТренировкиСсылка)
	
	МассивНормативов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипТренировкиНормативы.Норматив КАК Норматив
	|ИЗ
	|	Справочник.ТипТренировки.Нормативы КАК ТипТренировкиНормативы
	|ГДЕ
	|	ТипТренировкиНормативы.Ссылка = &СсылкаТипаТренировки" ;
	
	Запрос.УстановитьПараметр("СсылкаТипаТренировки", ТипТренировкиСсылка);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивНормативов.Добавить(Выборка.Норматив);
	КонецЦикла;
	
	Возврат МассивНормативов;
	
КонецФункции

&НаКлиенте
Процедура КараулПриИзменении(Элемент)

	Объект.Сотрудники.Очистить();
	
	Если Объект.Караул.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = ПолучитьСотрудниковКараулаНаСервере(Объект.Караул);
	
	Для Каждого СотрудникИнфо Из МассивСотрудников Цикл
		НоваяСтрока = Объект.Сотрудники.Добавить();
		НоваяСтрока.Сотрудник = СотрудникИнфо.Сотрудник;
		НоваяСтрока.Должность = СотрудникИнфо.Должность;
	КонецЦикла;
КонецПроцедуры   
&НаСервере
Функция ПолучитьСотрудниковКараулаНаСервере(КараулСсылка)
	
	МассивСотрудников = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    СотрудникиГруппы.Сотрудник КАК Сотрудник,
	|    СотрудникиГруппы.Должность КАК Должность
	|ИЗ
	|    Справочник.ГруппаСотрудников.Сотрудники КАК СотрудникиГруппы
	|ГДЕ
	|    СотрудникиГруппы.Ссылка = &Караул";
	
	Запрос.УстановитьПараметр("Караул", КараулСсылка);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураСотрудника = Новый Структура;
		СтруктураСотрудника.Вставить("Сотрудник", Выборка.Сотрудник);
		СтруктураСотрудника.Вставить("Должность", Выборка.Должность);
		
		МассивСотрудников.Добавить(СтруктураСотрудника);
	КонецЦикла;

	Возврат МассивСотрудников;
	
КонецФункции
