
Процедура Печать(ТабДок, Ссылка) Экспорт
	ТабДок.МасштабПечати = 132;
    ТабДок.АвтоМасштаб = Ложь; 
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВыдачаВещевогоИмущества.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыдачаВещевогоИмущества.Дата,
	|	ВыдачаВещевогоИмущества.Комментарий,
	|	ВыдачаВещевогоИмущества.Номер,
	|	ВыдачаВещевогоИмущества.Организация,
	|	ВыдачаВещевогоИмущества.Ответственный,
	|	ВыдачаВещевогоИмущества.Склад,
	|	ВыдачаВещевогоИмущества.ФизическоеЛицо,
	|	ВыдачаВещевогоИмущества.ВещевоеИмущество.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Размер,
	|		Количество,
	|		ПланДатаСписания
	|	)
	|ИЗ
	|	Документ.ВыдачаВещевогоИмущества КАК ВыдачаВещевогоИмущества
	|ГДЕ
	|	ВыдачаВещевогоИмущества.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Номер =  Макет.ПолучитьОбласть("Номер");
	Дата =  Макет.ПолучитьОбласть("Дата");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВещевоеИмуществоШапка = Макет.ПолучитьОбласть("ВещевоеИмуществоШапка");
	ОбластьВещевоеИмущество = Макет.ПолучитьОбласть("ВещевоеИмущество");
	Подвал = Макет.ПолучитьОбласть("Подвал");
    Подпись = Макет.ПолучитьОбласть("Подпись");
	Комментарий = Макет.ПолучитьОбласть("Комментарий");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
        Номер.Параметры.Заполнить(Выборка);
		ТабДок.Вывести (Номер); 
		Дата.Параметры.Заполнить(Выборка);
		ТабДок.Вывести (Дата);
		Шапка.Параметры.Заполнить(Выборка); 
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВещевоеИмуществоШапка);
		ВыборкаВещевоеИмущество = Выборка.ВещевоеИмущество.Выбрать();
		Пока ВыборкаВещевоеИмущество.Следующий() Цикл
			ОбластьВещевоеИмущество.Параметры.Заполнить(ВыборкаВещевоеИмущество);
			ТабДок.Вывести(ОбластьВещевоеИмущество, ВыборкаВещевоеИмущество.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
        ТабДок.Вывести(Подпись);
		Комментарий.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Комментарий);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
