Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.НоменклатураНаСкладах.Записывать = Истина;
	Движения.НоменклатураНаСкладах.Записать();
	Движения.НоменклатураНаСкладах.Записывать = Истина;
	Движения.НоменклатураСотрудников.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Номенклатура КАК Номенклатура,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Размер КАК Размер,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Ссылка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(ВыдачаВещевогоИмуществаВещевоеИмущество.Количество) КАК Количество,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.ПланДатаСписания КАК ПланДатаСписания
	|ПОМЕСТИТЬ ВТ_ВещевоеИмущество
	|ИЗ
	|	Документ.ВыдачаВещевогоИмущества.ВещевоеИмущество КАК ВыдачаВещевогоИмуществаВещевоеИмущество
	|ГДЕ
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Номенклатура,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Размер,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Ссылка.ФизическоеЛицо,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.ПланДатаСписания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВещевоеИмущество.Номенклатура КАК Номенклатура,
	|	ВТ_ВещевоеИмущество.Размер КАК Размер,
	|	ВТ_ВещевоеИмущество.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ВещевоеИмущество.Количество КАК Количество,
	|	ЕСТЬNULL(НоменклатураНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоНаСкладе,
	|	ВТ_ВещевоеИмущество.ПланДатаСписания КАК ПланДатаСписания
	|ИЗ
	|	ВТ_ВещевоеИмущество КАК ВТ_ВещевоеИмущество
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НоменклатураНаСкладах.Остатки(
	|				&Дата,
	|				(Номенклатура, Размер) В
	|						(ВЫБРАТЬ
	|							ВТ_ВещевоеИмущество.Номенклатура КАК Номенклатура,
	|							ВТ_ВещевоеИмущество.Размер КАК Размер
	|						ИЗ
	|							ВТ_ВещевоеИмущество КАК ВТ_ВещевоеИмущество)
	|					И Склад = &Склад) КАК НоменклатураНаСкладахОстатки
	|		ПО ВТ_ВещевоеИмущество.Номенклатура = НоменклатураНаСкладахОстатки.Номенклатура
	|			И ВТ_ВещевоеИмущество.Размер = НоменклатураНаСкладахОстатки.Размер";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Количество > ВыборкаДетальныеЗаписи.КоличествоНаСкладе Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Номенклатуры ""%1"" не хватает на указанном складе в количестве %2 шт.", 
			ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Количество - ВыборкаДетальныеЗаписи.КоличествоНаСкладе);
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.НоменклатураНаСкладах.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Организация = Организация;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Размер = ВыборкаДетальныеЗаписи.Размер;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		
		Движение = Движения.НоменклатураСотрудников.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Организация = Организация;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Размер = ВыборкаДетальныеЗаписи.Размер;
		Движение.ПлановаяДатаСписания = ВыборкаДетальныеЗаписи.ПланДатаСписания;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		
	КонецЦикла;
	
КонецПроцедуры