Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ВещевоеИмуществоСотрудников
	Движения.ВещевоеИмуществоСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущетво из ВещевоеИмущество Цикл
		Движение = Движения.ВещевоеИмуществоСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.Номенклатура = ТекСтрокаВещевоеИмущетво.Номенклатура;
		Движение.Размер = ТекСтрокаВещевоеИмущетво.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущетво.Количество;
	КонецЦикла;

	// регистр ТоварыНаСкладах
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущетво из ВещевоеИмущество Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаВещевоеИмущетво.Номенклатура;
		Движение.Размер = ТекСтрокаВещевоеИмущетво.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущетво.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры