&НаКлиенте
Процедура ОбновитьНаименование()
	Фамилия = Объект.Фамилия;
    Имя = Объект.Имя;
    Отчество = Объект.Отчество;
    
    Наименование = Фамилия;
    
    Если Имя <> "" Тогда
        Наименование = Наименование + " " + Лев(Имя, 1) + ".";
    КонецЕсли;
    
    Если Отчество <> "" Тогда
        Наименование = Наименование + Лев(Отчество, 1) + ".";
    КонецЕсли;
    
    Объект.Наименование = Наименование;

КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
    ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
    ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
    ОбновитьНаименование();
КонецПроцедуры

