&НаКлиенте
Процедура ОбновитьНаименование()
	Фамилия = Объект.Фамилия;
	Имя = Объект.Имя;
	Отчество = Объект.Отчество;
	
	Наименование = Фамилия;
	
	Если Имя <> "" Тогда
		Наименование = Наименование + " " + Лев(Имя, 1) + ".";
	КонецЕсли;
	
	Если Отчество <> "" Тогда
		Наименование = Наименование + Лев(Отчество, 1) + ".";
	КонецЕсли;
	
	Объект.Наименование = Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВставитьКартинку(Команда)
	Оповещение = Новый ОписаниеОповещения("ВыборФайла", ЭтотОбъект);
	НачатьПомещениеФайла (Оповещение,,,Истина,УникальныйИдентификатор);
КонецПроцедуры   

&НаКлиенте
Процедура ВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Не Результат Тогда	
		Возврат;	
	КонецЕсли;	
	СсылкаНаКартинку = Адрес;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(объект.Ссылка, "ДанныеКартинки");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку) Тогда
		ТекущийОбъект.ДанныеКартинки = Новый ХранилищеЗначения (ПолучитьИзВременногоХранилища(СсылкаНАКартинку));	
	КонецЕсли;
КонецПроцедуры






