
&НаКлиенте
Процедура ПодобратьИмущество(Команда)
    
    // Проверяем, что сотрудник выбран
    Если Не ЗначениеЗаполнено(Объект.ФИОСотрудника) Тогда
        Сообщить("Сначала выберите сотрудника.");
        Возврат;
    КонецЕсли;
	//
	//// Загружаем список имущества сотрудника
	//СписокВыбора = ЗагрузитьИмуществоСотрудникаНаСервере(Объект.ФИОСотрудника);
    
    // Открываем форму выбора
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ФИОСотрудника", Объект.ФИОСотрудника);
	
    ОткрытьФорму("Документ.Списание.Форма.ВещевоеИмущество", ПараметрыФормы, ЭтотОбъект,,,,,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
    
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, Источник)
    
    Если ВыбранноеЗначение = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Добавляем выбранные позиции
    Для Каждого Строка Из ВыбранноеЗначение Цикл
        НоваяСтрока = Объект.ВещевоеИмущество.Добавить();
        НоваяСтрока.Наименование = Строка.Наименование;
        НоваяСтрока.Размер = Строка.Размер;
        НоваяСтрока.Количество = Строка.Количество;
        НоваяСтрока.ДатаВыдачи = Строка.ДатаВыдачи;
        НоваяСтрока.ДатаСписания = ТекущаяДата();
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПослеВыбораВещевогоИмущества" Тогда
		
		НоваяСтрока = Объект.ВещевоеИмущество.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	ТекДанные = Элементы.ВещевоеИмущество.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВещевоеИмущество.Удалить(ТекДанные);
	
КонецПроцедуры
