
Функция ОпределитьВозрастнуюГруппу(ФизЛицо, ДатаПроведения) Экспорт

    Возраст = Год(ДатаПроведения) - Год(ФизЛицо.ДатаРождения);
     Если ФизЛицо.ДатаРождения = Неопределено Или ДатаПроведения = Неопределено Тогда
        Возврат 0;
    КонецЕсли;

    Возраст = Год(ДатаПроведения) - Год(ФизЛицо.ДатаРождения);
    
    Если (Месяц(ДатаПроведения) < Месяц(ФизЛицо.ДатаРождения)) 
        Или (Месяц(ДатаПроведения) = Месяц(ФизЛицо.ДатаРождения) 
        И День(ДатаПроведения) < День(ФизЛицо.ДатаРождения)) Тогда
        Возраст = Возраст - 1;
    КонецЕсли;

    Если Возраст < 0 Тогда
        Возраст = 0;
    КонецЕсли;
    

    Запрос = Новый Запрос;
    Запрос.Текст = "
    |ВЫБРАТЬ
    |	ВозрастныеГруппы.Ссылка КАК Ссылка
    |ИЗ
    |	Справочник.ВозрастныеГруппы КАК ВозрастныеГруппы
    |ГДЕ
    |	ВозрастныеГруппы.МинимальныйВозраст <= &Возраст
    |	И ВозрастныеГруппы.МаксимальныйВозраст >= &Возраст";
    Запрос.УстановитьПараметр("Возраст", Возраст);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
    КонецФункции

	Функция НайтиНорматив(Норматив, ВозрастнаяГруппа, ДатаПроведения) Экспорт  
		    
    Запрос = Новый Запрос;
    Запрос.Текст ="
    |ВЫБРАТЬ
   	|	КонтрольныеЗначенияУпражнений.Оценка КАК Оценка,
   	|	КонтрольныеЗначенияУпражнений.МинимальноеЗначение КАК МинимальноеЗначение,
   	|	КонтрольныеЗначенияУпражнений.МаксимальноеЗначение КАК МаксимальноеЗначение
   	|ИЗ
   	|	РегистрСведений.КонтрольныеЗначенияУпражнений КАК КонтрольныеЗначенияУпражнений
   	|ГДЕ
   	|	КонтрольныеЗначенияУпражнений.Норматив = &Норматив
   	|	И КонтрольныеЗначенияУпражнений.ВозрастнаяГруппа = &ВозрастнаяГруппа";
    Запрос.УстановитьПараметр("Норматив", Норматив);
    Запрос.УстановитьПараметр("ВозрастнаяГруппа", ВозрастнаяГруппа);
    
    Результат = Запрос.Выполнить();
    
    Возврат Результат.Выгрузить();
   КонецФункции

Функция РассчитатьОценку(Результат, Нормативы) Экспорт
   
    Если ТипЗнч(Результат) = Тип("Булево") И Не Результат Тогда
        Возврат Перечисления.Оценка.НеСдал;
    КонецЕсли;
    
    Если ТипЗнч(Результат) = Тип("Число") Тогда
        ЧисловойРезультат = Результат;
        
        Для Каждого Норматив Из Нормативы Цикл
            
            МинСоответствует = Истина;
            МаксСоответствует = Истина;
            
        Если ТипЗнч(Норматив.МинимальноеЗначение) = Тип("Булево") Тогда
                МинСоответствует = Норматив.МинимальноеЗначение; 
            ИначеЕсли ТипЗнч(Норматив.МинимальноеЗначение) = Тип("Число") Тогда
                МинСоответствует = ЧисловойРезультат >= Норматив.МинимальноеЗначение;
        КонецЕсли;
            
        Если ТипЗнч(Норматив.МаксимальноеЗначение) = Тип("Булево") Тогда
                МаксСоответствует = Норматив.МаксимальноеЗначение; 
            ИначеЕсли ТипЗнч(Норматив.МаксимальноеЗначение) = Тип("Число") Тогда
                МаксСоответствует = ЧисловойРезультат <= Норматив.МаксимальноеЗначение;
        КонецЕсли;
            
        Если МинСоответствует И МаксСоответствует Тогда
                Возврат Норматив.Оценка;
        КонецЕсли;
            
        КонецЦикла;
    КонецЕсли;
    
    Возврат Перечисления.Оценка.НеСдал;
    
КонецФункции

Функция ПолучитьНормативПоОценке(Нормативы, Оценка) Экспорт
    
    Для Каждого Норматив Из Нормативы Цикл
        Если Норматив.Оценка = Оценка Тогда
            Возврат Норматив;
        КонецЕсли;
    КонецЦикла;
    
    Возврат Неопределено;
    
КонецФункции