
&НаКлиенте
Процедура ПодобратьИмущество(Команда)
	// Проверяем, что сотрудник выбран
    Если Не ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
        Сообщить("Сначала выберите сотрудника.");
        Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ФизическоеЛицо, Дата", Объект.ФизическоеЛицо, Объект.Дата);
	
	Оповещение = Новый ОписаниеОповещения("ПеренестиНоменклатуруПосле", ЭтотОбъект);
	
	ОткрытьФорму("Документ.СписаниеВещевогоИмущества.Форма.ФормаПодбораНоменклатуры", ПараметрыФормы, , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНоменклатуруПосле(ВыбранноеЗначение, Источник) Экспорт
    
    Если ВыбранноеЗначение = Неопределено И Не ВыбранноеЗначение.Свойство("ВыбранноеЗначение") Тогда
        Возврат;
    КонецЕсли;
	
	МассивСтрок = ВыбранноеЗначение.ВыбранноеЗначение;
	
    // Добавляем выбранные позиции
    Для Каждого Строка Из МассивСтрок Цикл
        НоваяСтрока = Объект.ВещевоеИмущество.Добавить();
        НоваяСтрока.Номенклатура = Строка.Номенклатура;
        НоваяСтрока.Размер = Строка.Размер;
        НоваяСтрока.Количество = Строка.Количество;
    КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПослеВыбораВещевогоИмущества" Тогда
		
		НоваяСтрока = Объект.ВещевоеИмущество.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	ТекДанные = Элементы.ВещевоеИмущество.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВещевоеИмущество.Удалить(ТекДанные);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.Основная");
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		ИмяПользователя = ИмяПользователя();
		
		НайденныйСотрудник = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);
		
		Если ЗначениеЗаполнено(НайденныйСотрудник) Тогда
			Объект.Ответственный = НайденныйСотрудник;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

