&НаКлиенте
Перем ТекущаяГруппаДоступа;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяГруппаДоступа = Объект.ГруппаДоступа;
КонецПроцедуры


&НаСервере
Процедура ГруппаДоступаПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Объект.ГруппаДоступа) Тогда
		Объект.НазначенныеРоли.Очистить();
		Объект.НазначенныеРоли.Загрузить(Объект.ГруппаДоступа.Роли.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДоступаПриИзменении(Элемент)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = "При изменении группы доступа список ролей перезаполниться, продолжить?";
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаГруппаДоступа", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, Текст, Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаГруппаДоступа(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.ГруппаДоступа = ТекущаяГруппаДоступа;
		Возврат;
	КонецЕсли;
	
	ТекущаяГруппаДоступа = Объект.ГруппаДоступа;
	
	ГруппаДоступаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Поиск существующего пользователя ИБ по уникальному идентификатору
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.УникальныйИдентификатор);
	
	// Если пользователь не найден - создаем нового
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя = ТекущийОбъект.Логин;
		ПользовательИБ.ПолноеИмя = ТекущийОбъект.Наименование;
		ПользовательИБ.ПоказыватьВСпискеВыбора = Истина;
	КонецЕсли;
	
	// Устанавливаем пароль (проверяем, что пароль заполнен)
	Если Не ПустаяСтрока(ТекущийОбъект.Пароль) Тогда
		ПользовательИБ.Пароль = ТекущийОбъект.Пароль;
	КонецЕсли;
	
	// Очищаем старые роли
	ПользовательИБ.Роли.Очистить();
	
	Для Каждого СтрокаТЧ Из ТекущийОбъект.НазначенныеРоли Цикл
		
		Если СтрокаТЧ.Роль = Перечисления.Роли.СистемныйАдминистратор Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.СистемныйАдминистратор);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ОрганизацииЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ОрганизацииЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ФизическиеЛицаЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ФизическиеЛицаЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ГруппаСотрудниковЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ГруппаСотрудниковЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ВозрастныеГруппыЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ВозрастныеГруппыЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.НормативЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.НормативЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ТипТренировкиЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ТипТренировкиЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.МестоПроведенияТренировкиЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.МестоПроведенияТренировкиЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.СкладыЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.СкладыЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.НоменклатураЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.НоменклатураЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ПользователиЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПользователиЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ГруппыДоступаЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ГруппыДоступаЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ПланСдачиНормативовЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПланСдачиНормативовЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.СдачаНормативовЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.СдачаНормативовЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ПоступлениеНаСкладЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПоступлениеНаСкладЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ВыдачаВещевогоИмуществаЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ВыдачаВещевогоИмуществаЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.СписаниеВещевогоИмуществаЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.СписаниеВещевогоИмуществаЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.СписаниеСоСкладаЧтение Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.СписаниеСоСкладаЧтение);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ОрганизацииЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ОрганизацииЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ФизическиеЛицаЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ФизическиеЛицаЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ГруппаСотрудниковЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ГруппаСотрудниковЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ВозрастныеГруппыЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ВозрастныеГруппыЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.НормативЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.НормативЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ТипТренировкиЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ТипТренировкиЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.МестоПроведенияТренировкиЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.МестоПроведенияТренировкиЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.СкладыЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.СкладыЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.НоменклатураЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.НоменклатураЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ПользователиЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПользователиЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ГруппыДоступаЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ГруппыДоступаЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ПланСдачиНормативовЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПланСдачиНормативовЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.СдачаНормативовЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.СдачаНормативовЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ПоступлениеНаСкладЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПоступлениеНаСкладЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ВыдачаВещевогоИмуществаЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ВыдачаВещевогоИмуществаЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.СписаниеВещевогоИмуществаЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.СписаниеВещевогоИмуществаЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.СписаниеСоСкладаЧтениеИЗапись Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.СписаниеСоСкладаЧтениеИЗапись);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ПодсистемаБоеваяПодготовкаПросмотр Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПодсистемаБоеваяПодготовкаПросмотр);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ПодсистемаВещевоеОбеспечениеПросмотр Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПодсистемаВещевоеОбеспечениеПросмотр);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ПодсистемаЛичныйСоставПросмотр Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПодсистемаЛичныйСоставПросмотр);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ПодсистемаПользователиПросмотр Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПодсистемаПользователиПросмотр);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ЗагрузкаВещевогоИмуществаПросмотрИИСпользование Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ЗагрузкаВещевогоИмуществаПросмотрИИСпользование);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ЗагрузкаБоевойПодготовкиПросмотрИИСпользование Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ЗагрузкаБоевойПодготовкиПросмотрИИСпользование);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ЗагрузкаЛичногоСоставаПросмотрИИСпользование Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ЗагрузкаЛичногоСоставаПросмотрИИСпользование);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ОтчетБоеваяГотовностьПросмотрИИСпользование Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ОтчетБоеваяГотовностьПросмотрИИСпользование);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ОтчетСписаниеИмуществаПросмотрИИСпользование Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ОтчетСписаниеИмуществаПросмотрИИСпользование);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ОтчетБоеваяСтатистикаСотрудниковПросмотрИИСпользование Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ОтчетБоеваяСтатистикаСотрудниковПросмотрИИСпользование);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ОтчетВещевоеИмуществоСотрудниковПросмотрИИСпользование Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ОтчетВещевоеИмуществоСотрудниковПросмотрИИСпользование);
			
		ИначеЕсли СтрокаТЧ.Роль = Перечисления.Роли.ОтчетТоварыНаСкладахПросмотрИИСпользование Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ОтчетТоварыНаСкладахПросмотрИИСпользование);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Записываем пользователя ИБ
	Попытка
		ПользовательИБ.Записать();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при записи пользователя: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	// Сохраняем уникальный идентификатор для связи
	ТекущийОбъект.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
	
КонецПроцедуры