
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиИмуществаСотрудников Приход
	Движения.ОстаткиИмуществаСотрудников.Записывать = Истина;
	Движения.ОстаткиИмуществаСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущество из ВещевоеИмущество Цикл
		Движение = Движения.ОстаткиИмуществаСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Дата = Дата;
		Движение.Сотрудник = ФИОСотрудника;
		Движение.Наименование = ТекСтрокаВещевоеИмущество.Наименование;
		Движение.Размер = ТекСтрокаВещевоеИмущество.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущество.Количество;
	КонецЦикла;
	Движения.Остатки.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущество Из ВещевоеИмущество Цикл
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;  
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаВещевоеИмущество.Наименование;
		Движение.Размер = ТекСтрокаВещевоеИмущество.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущество.Количество;
	КонецЦикла;
	 
    Если ФИОСотрудника = Неопределено Тогда
        Сообщить("Не выбран сотрудник!");
        Возврат;
    КонецЕсли;
    
    СотрудникОбъект = ФИОСотрудника.ПолучитьОбъект();
    
        Для Каждого СтрокаДокумента Из ВещевоеИмущество Цикл
        
        Найдено = Ложь;
        Для Каждого СтрокаСотрудника Из СотрудникОбъект.ВещевоеИмущество Цикл
            Если СтрокаСотрудника.Наименование = СтрокаДокумента.Наименование
               И СтрокаСотрудника.Размер = СтрокаДокумента.Размер Тогда
                Найдено = Истина;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если Найдено Тогда
            Для Каждого СтрокаСотрудника Из СотрудникОбъект.ВещевоеИмущество Цикл
                Если СтрокаСотрудника.Наименование = СтрокаДокумента.Наименование
                   И СтрокаСотрудника.Размер = СтрокаДокумента.Размер Тогда
                    СтрокаСотрудника.ДатаСписания = СтрокаДокумента.ДатаСписания;
                КонецЕсли;
            КонецЦикла;
        Иначе
            НоваяСтрока = СотрудникОбъект.ВещевоеИмущество.Добавить();
            НоваяСтрока.Наименование = СтрокаДокумента.Наименование;
            НоваяСтрока.Размер = СтрокаДокумента.Размер;
            НоваяСтрока.Количество = СтрокаДокумента.Количество;
            НоваяСтрока.ДатаВыдачи = Дата; 
            НоваяСтрока.ДатаСписания = СтрокаДокумента.ДатаСписания;
        КонецЕсли;
        
    КонецЦикла;
        СотрудникОбъект.Записать();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры;