
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФизическоеЛицо = Параметры.ФизическоеЛицо;
	Дата = Параметры.Дата;
	
	ТаблицаНоменклатуры.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураСотрудниковОстатки.Номенклатура КАК Номенклатура,
	|	НоменклатураСотрудниковОстатки.Размер КАК Размер,
	|	НоменклатураСотрудниковОстатки.КоличествоОстаток КАК Количество,
	|	НоменклатураСотрудниковОстатки.ПлановаяДатаСписания КАК ПлановаяДатаСписания
	|ИЗ
	|	РегистрНакопления.НоменклатураСотрудников.Остатки(&Дата, ФизическоеЛицо = &ФизическоеЛицо) КАК НоменклатураСотрудниковОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПлановаяДатаСписания";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаНоменклатуры.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНоменклатуру(Команда)
	
	МассивИндексов = Элементы.ТаблицаНоменклатуры.ВыделенныеСтроки;
	МассивСтрок = Новый Массив;
	
	Для Каждого Индекс Из МассивИндексов ЦИкл
		
		МассивСтрок.Добавить(ТаблицаНоменклатуры[Индекс]);
		
	КонецЦикла;
	
	Закрыть(Новый Структура("ВыбранноеЗначение", МассивСтрок));
	
КонецПроцедуры
