&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФизическоеЛицо = Параметры.ФизическоеЛицо;
	Дата = Параметры.Дата;
	
	ТаблицаНоменклатуры.Очистить();
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураСотрудников.Номенклатура,
	|	НоменклатураСотрудников.Размер,
	|	СУММА(ВЫБОР
	|		КОГДА НоменклатураСотрудников.ВидДвижения = &Приход 
	|			ТОГДА НоменклатураСотрудников.Количество
	|		КОГДА НоменклатураСотрудников.ВидДвижения = &Расход 
	|			ТОГДА -НоменклатураСотрудников.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Остаток,
	|	МАКСИМУМ(НоменклатураСотрудников.ПлановаяДатаСписания) КАК ПлановаяДатаСписания
	|ИЗ
	|	РегистрНакопления.НоменклатураСотрудников КАК НоменклатураСотрудников
	|ГДЕ
	|	НоменклатураСотрудников.ФизическоеЛицо = &ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураСотрудников.Номенклатура,
	|	НоменклатураСотрудников.Размер";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Остаток > 0 Тогда
			НоваяСтрока = ТаблицаНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			НоваяСтрока.Размер = ВыборкаДетальныеЗаписи.Размер;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Остаток;
			НоваяСтрока.ПлановаяДатаСписания = ВыборкаДетальныеЗаписи.ПлановаяДатаСписания;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНоменклатуру(Команда)
	
	МассивИндексов = Элементы.ТаблицаНоменклатуры.ВыделенныеСтроки;
	МассивСтрок = Новый Массив;
	
	Для Каждого Индекс Из МассивИндексов ЦИкл
		
		МассивСтрок.Добавить(ТаблицаНоменклатуры[Индекс]);
		
	КонецЦикла;
	
	Закрыть(Новый Структура("ВыбранноеЗначение", МассивСтрок));
	
КонецПроцедуры
