Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр КонтрольныеЗначенияУпражнений
	Движения.КонтрольныеЗначенияУпражнений.Записывать = Истина;
	Для Каждого ТекСтрокаНормативы из Нормативы Цикл
		Движение = Движения.КонтрольныеЗначенияУпражнений.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Норматив = ТекСтрокаНормативы.Норматив;
		Движение.Оценка = ТекСтрокаНормативы.Оценка;
		Движение.ВозрастнаяГруппа = ТекСтрокаНормативы.ВозрастнаяГруппа;
		Движение.МинимальноеЗначение = ТекСтрокаНормативы.МинимальноеЗначение;
		Движение.МаксимальноеЗначение = ТекСтрокаНормативы.МаксимальноеЗначение;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры