Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр Списание
	Движения.Списание.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущество из ВещевоеИмущество Цикл
		Движение = Движения.Списание.Добавить();
		Движение.ДатаСписания = Дата; 
		Движение.Сотрудник = ФИОСотрудника;
		Движение.Наименование = ТекСтрокаВещевоеИмущество.Наименование;
		Движение.Размер = ТекСтрокаВещевоеИмущество.Размер;
		Движение.Причина = ТекСтрокаВещевоеИмущество.Причина;
		Движение.Количество = ТекСтрокаВещевоеИмущество.Количество;
	КонецЦикла;
	
	Движения.ОстаткиИмуществаСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущество Из ВещевоеИмущество Цикл
		Движение = Движения.ОстаткиИмуществаСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ФИОСотрудника;
		Движение.Наименование = ТекСтрокаВещевоеИмущество.Наименование;
		Движение.Размер = ТекСтрокаВещевоеИмущество.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущество.Количество;
	КонецЦикла; 
	Если ФИОСотрудника = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Сотрудник = ФИОСотрудника.ПолучитьОбъект();
    
    Для Каждого СтрокаДок Из ВещевоеИмущество Цикл
        Для Каждого СтрокаСотрудника Из Сотрудник.ВещевоеИмущество Цикл
            Если СтрокаСотрудника.Наименование = СтрокаДок.Наименование Тогда
                Сотрудник.ВещевоеИмущество.Удалить(СтрокаСотрудника);
                Прервать;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    
    Сотрудник.Записать();   
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры;