
&НаСервере
Функция ВещевоеИмуществоНоменклатураПриИзмененииНаСервере(Номенклатура)
	
	Возврат Объект.Дата + Номенклатура.СрокИспользования * 86400;
	
КонецФункции

&НаКлиенте
Процедура ОбновлениеСпискаДоступныхСроковИспользования(Элемент)
	
	ТекущиеДанные = Элементы.ВещевоеИмущетво.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ПланДатаСписания = ВещевоеИмуществоНоменклатураПриИзмененииНаСервере(ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.Основная");
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		ИмяПользователя = ИмяПользователя();
		
		НайденныйСотрудник = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);
		
		Если ЗначениеЗаполнено(НайденныйСотрудник) Тогда
			Объект.Ответственный = НайденныйСотрудник;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
